Ran Plan for 4 projects:

1. dir: `infra/global/iam/roles/atlantis` workspace: `default`
1. dir: `infra` workspace: `default`
1. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
1. dir: `infra/us-east-1/prod/kms` workspace: `default`

### 1. dir: `infra/global/iam/roles/atlantis` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #104. To continue, delete the lock from #104 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 2. dir: `infra` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra": 
time=2024-01-11T11:17:54Z level=error msg=Error: Error in function call


time=2024-01-11T11:17:54Z level=error msg=  on /atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra/terragrunt.hcl line 37, in locals:

time=2024-01-11T11:17:54Z level=error msg=  37:   account_vars = read_terragrunt_config(find_in_parent_folders("account.hcl"))

time=2024-01-11T11:17:54Z level=error msg=

time=2024-01-11T11:17:54Z level=error msg=Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not
find a account.hcl in any of the parent folders of
/atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra/terragrunt.hcl.
Cause: Traversed all the way to the root..


time=2024-01-11T11:17:54Z level=error msg=Encountered error while evaluating locals in file /atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra/terragrunt.hcl
time=2024-01-11T11:17:54Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra/terragrunt.hcl:37,41-64: Error in function call; Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not find a account.hcl in any of the parent folders of /atlantis-data/repos/input-output-hk/sc-dev-platform/107/default/infra/terragrunt.hcl. Cause: Traversed all the way to the root..
time=2024-01-11T11:17:54Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```
</details>

---
### 3. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # aws_route_table.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:677160962006:route-table/rtb-0f8770a1cde5a93e4" -> null
      - id               = "rtb-0f8770a1cde5a93e4" -> null
      - owner_id         = "677160962006" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "management-vpc-private-us-east-1a"
        } -> null
      - tags_all         = {
          - "Environment"  = "mgmt"
          - "Name"         = "management-vpc-private-us-east-1a"
          - "Organization" = "iog"
          - "Project"      = "scde"
          - "Terraform"    = "true"
          - "Tribe"        = "smartcontracts"
        } -> null
      - vpc_id           = "vpc-05d9f25d63d8ffb04" -> null
    }

  # aws_route_table.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:677160962006:route-table/rtb-0e05291c6e89bd13d" -> null
      - id               = "rtb-0e05291c6e89bd13d" -> null
      - owner_id         = "677160962006" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "management-vpc-private-us-east-1b"
        } -> null
      - tags_all         = {
          - "Environment"  = "mgmt"
          - "Name"         = "management-vpc-private-us-east-1b"
          - "Organization" = "iog"
          - "Project"      = "scde"
          - "Terraform"    = "true"
          - "Tribe"        = "smartcontracts"
        } -> null
      - vpc_id           = "vpc-05d9f25d63d8ffb04" -> null
    }

  # aws_route_table_association.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-048e01a081f65a6b9" -> null
      - route_table_id = "rtb-0f8770a1cde5a93e4" -> null
      - subnet_id      = "subnet-04dc489cceef697aa" -> null
    }

  # aws_route_table_association.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-01174579f66ad3981" -> null
      - route_table_id = "rtb-0e05291c6e89bd13d" -> null
      - subnet_id      = "subnet-00d85bd5f45d9bca7" -> null
    }

  # aws_subnet.private[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:677160962006:subnet/subnet-04dc489cceef697aa" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.100.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04dc489cceef697aa" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "677160962006" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "management-vpc-private-us-east-1a"
        } -> null
      - tags_all                                       = {
          - "Environment"  = "mgmt"
          - "Name"         = "management-vpc-private-us-east-1a"
          - "Organization" = "iog"
          - "Project"      = "scde"
          - "Terraform"    = "true"
          - "Tribe"        = "smartcontracts"
        } -> null
      - vpc_id                                         = "vpc-05d9f25d63d8ffb04" -> null
    }

  # aws_subnet.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:677160962006:subnet/subnet-00d85bd5f45d9bca7" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.100.48.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00d85bd5f45d9bca7" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "677160962006" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "management-vpc-private-us-east-1b"
        } -> null
      - tags_all                                       = {
          - "Environment"  = "mgmt"
          - "Name"         = "management-vpc-private-us-east-1b"
          - "Organization" = "iog"
          - "Project"      = "scde"
          - "Terraform"    = "true"
          - "Tribe"        = "smartcontracts"
        } -> null
      - vpc_id                                         = "vpc-05d9f25d63d8ffb04" -> null
    }

Plan: 0 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ database_route_table_ids                    = [
      - "rtb-0f8770a1cde5a93e4",
      - "rtb-0e05291c6e89bd13d",
    ]
  ~ elasticache_route_table_ids                 = [
      - "rtb-0f8770a1cde5a93e4",
      - "rtb-0e05291c6e89bd13d",
    ]
  ~ private_route_table_association_ids         = [
      - "rtbassoc-048e01a081f65a6b9",
      - "rtbassoc-01174579f66ad3981",
    ]
  ~ private_route_table_ids                     = [
      - "rtb-0f8770a1cde5a93e4",
      - "rtb-0e05291c6e89bd13d",
    ]
  ~ private_subnet_arns                         = [
      - "arn:aws:ec2:us-east-1:677160962006:subnet/subnet-04dc489cceef697aa",
      - "arn:aws:ec2:us-east-1:677160962006:subnet/subnet-00d85bd5f45d9bca7",
    ]
  ~ private_subnets                             = [
      - "subnet-04dc489cceef697aa",
      - "subnet-00d85bd5f45d9bca7",
    ]
  ~ private_subnets_cidr_blocks                 = [
      - "10.100.32.0/20",
      - "10.100.48.0/20",
    ]
  ~ redshift_route_table_ids                    = [
      - "rtb-0f8770a1cde5a93e4",
      - "rtb-0e05291c6e89bd13d",
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/vpc`
</details>
Plan: 0 to add, 0 to change, 6 to destroy.

---
### 4. dir: `infra/us-east-1/prod/kms` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.this["dapps-world-prod"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/dapps-world-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "e8ccc1e3-c590-42f9-bda3-f7a55dcd787c"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ aliases                       = {
      + dapps-world-prod = {
          + arn            = (known after apply)
          + id             = (known after apply)
          + name           = "alias/dapps-world-prod"
          + name_prefix    = (known after apply)
          + target_key_arn = (known after apply)
          + target_key_id  = "e8ccc1e3-c590-42f9-bda3-f7a55dcd787c"
        }
        # (1 unchanged attribute hidden)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/kms`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Fkms%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/kms`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`